
const entrance = {
  '放大进入': ['正中', '上', '左上', '右上', '左', '右', '左下', '右下', '下', '水平自中', '水平自左', '水平自右', '垂直自中', '垂直自上', '垂直自下'],
  '渐进翻转': ['水平至下', '水平至上', '垂直向右', '垂直向左', '斜向左上', '斜向右上'],
  '滑动进入': ['上', '左上', '右上', '左', '右', '左下', '右下', '下'],
  '弹跳进入': ['上', '左', '右', '下', '前', '后'],
  '淡入': ['正中', '上', '左上', '右上', '左', '右', '左下', '右下', '下', '前', '后']
}

const out = {
  '放大退出': ['正中', '上', '左上', '右上', '左', '右', '左下', '右下', '下', '水平自中', '水平自左', '水平自右', '垂直自中', '垂直自上', '垂直自下'],
  '翻转淡出': ['水平至下', '水平至上', '垂直向右', '垂直向左', '斜向左上', '斜向右上'],
  '滑动退出': ['上', '左上', '右上', '左', '右', '左下', '右下', '下'],
  '弹跳退出': ['上', '左', '右', '下', '前', '后'],
  '淡出': ['正中', '上', '左上', '右上', '左', '右', '左下', '右下', '下', '前', '后']
}

const existence = {
  '震动': ['1'],
  '闪烁': [],
  '握手': []
}

const cssName = {
  '放大进入': 'scale-in',
  '渐进翻转': 'flip-in',
  '滑动进入': 'slide-in',
  '弹跳进入': 'bounce-in',
  '淡入': 'fade-in',
  '放大退出': 'scale-out',
  '翻转淡出': 'flip-out',
  '滑动退出': 'slide-out',
  '弹跳退出': 'bounce-out',
  '淡出': 'fade-out',
  '正中': 'center',
  '上': 'top',
  '下': 'bottom',
  '左': 'left',
  '右': 'right',
  '前': 'fwd',
  '后': 'bck',
  '左上': 'tl',
  '右上': 'tr',
  '左下': 'bl',
  '右下': 'br',
  '水平': 'hor',
  '垂直': 'ver',
  '水平自中': 'hor-center',
  '水平自左': 'hor-left',
  '水平自右': 'hor-right',
  '垂直自中': 'ver-center',
  '垂直自上': 'ver-top',
  '垂直自下': 'ver-bottom',
  '水平至下': 'hor-bottom',
  '水平至上': 'hor-top',
  '垂直向右': 'ver-right',
  '垂直向左': 'ver-left',
  '斜向左上': 'diag-2-tl',
  '斜向右上': 'diag-1-tr'
}

function getAnimationClass (values) {
  if (values.length === 2) {
    if (cssName[values[0]] && cssName[values[1]]) {
      return cssName[values[0]] + '-' + cssName[values[1]]
    }
  }
}

export default {
  entrance,
  out,
  existence,
  cssName,
  getAnimationClass
}
